Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: When running on YARN or on Mesos, Flink’s remaining processes trigger the restart of JobManager or Task‐ Manager processes.
zh_cn: 当运行在YARN或Mesos上面时，Flink的其余进程会触发JobManager或TaskManager进程重启。

source: When running these commands, Kubernetes starts to deploy the requested contain‐ ers.
zh_cn: 运行这些命令会让Kubernetes开始部署所请求的容器。

source: When starting a Flink cluster in job mode, the cluster ID is automatically set to the ID of the started application and is therefore unique.
zh_cn: 而在作业模式下启动Flink集群，集群ID会被自动设置为启动应用的ID，因此无须担心唯一性问题。

source: When submitting an application to a running Flink cluster, the environment parallelism is set to the default parallelism of the cluster unless it is explicitly specified via the submission client (see “Running and Managing Streaming Applications” on page 245 for more details).
zh_cn: 如果应用是提交到Flink集群运行，那么除非提交客户端明确指定（详情请参阅第245页"运行和管理流式应用"一节），否则环境并行度将设置为集群默认并行度。

source: When taking a checkpoint, a source operator persists its read‐ ing positions and restores these positions during recovery.
zh_cn: 在生成检查点时，数据源算子会将读取位置持久化并在故障恢复过程中将其还原。

source: When the JAR file is in the classpath, the queryable state threads are automatically started and can
zh_cn: 如果Classpath中存在该JAR文件，可查询式状态的线程就会自动启动，以响应客户端的请求。

source: When the JobManager receives successful checkpoint notifications from all task instances, it sends the checkpoint completion notification to all interested tasks.
zh_cn: JobManager在收到从所有任务实例返回的检查点成功的消息后，就会将检查点的完成通知发送至所有相关任务。

source: When the RollingPolicy decides to roll a file, it is closed and moved into the pending state by renaming it.
zh_cn: 当RollingPolicy决定生成新文件时，原文件会被关闭，并通过重命名进入到等待状态。

source: When the application has been completely defined, it can be executed by call‐ ing StreamExecutionEnvironment.execute().
zh_cn: 在应用定义完成后，你就可以调用StreamExecutionEnvironment.execute()来执行它。

source: When the application is restarted, Flink tries to schedule the same tasks to the same worker nodes.
zh_cn: 当应用需要重启时，Flink会尝试将相同的任务调度到和之前相同的工作节点执行。

source: When the application is started from a savepoint or recovers from a failure, the reading offsets are retrieved from the latest checkpoint or save‐ point.
zh_cn: 当应用从某个保存点或故障重新恢复时，它再从最近一次的检查点或保存点中将读取偏移取出来。

source: When the client submits a job for execution, it connects to the YARN ResourceMan‐ ager to start a new YARN application master process that consists of a JobManager thread and a ResourceManager.
zh_cn: 客户端在提交作业执行时，会连接到YARN的ResourceManager来启动一个新的YARN应用主进程，该进程包括一个JobManager线程和一个ResourceManager。

source: When the filesystem reaches its connection limit and tries to open a new connection, it will block and wait for another connection to close.
zh_cn: 当文件系统已经达到最大连接数并还要尝试创建新连接时，请求会被阻塞，直到某个已有连接关闭。

source: When the first event comes in, it will be immediately processed with the minimum latency possible.
zh_cn: 当首个事件进入时，系统会立刻以尽可能低的延迟进行处理。

source: When the image is deployed as a JobMaster, the container starts a Flink master process that immediately picks up the bundled appli‐ cation to start it.
zh_cn: 当镜像作为JobMaster部署时，容器会启动一个Flink主进程，该进程会立即获取并启动绑定的应用。

source: When the job is started, Flink matches the individual state snapshots of the savepoint to all states of the started application.
zh_cn: 作业启动后，Flink会将保存点内的各个状态快照和应用所有状态进行匹配。

source: When the local copy is finished, the task continues its regular processing.
zh_cn: 在本地拷贝创建完成后，任务就可以继续它的常规处理。

source: When the new version of the application is started from a save‐ point of the previous version, the savepoint contains state that cannot be mapped to the restarted application.
zh_cn: 当新版本的应用从一个旧版本的保存点启动时，保存点中的部分状态将无法映射到重启的应用中。

source: When the processing method of a function with keyed input is called, Flink’s runtime auto‐
zh_cn: 对于一个作用在键值分区输入上的函数而言，

source: When the replay starts, previously emitted results might be overridden by earlier results.
zh_cn: 当开始重放数据时，之前发出的结果可能会被更早的结果覆盖。

source: When the slide interval is smaller than the window size, the windows overlap and elements can be assigned to more than one window.
zh_cn: 如果滑动间隔小于窗口大小，则窗口会出现重叠，此时元素会被分配给多个窗口；

source: When the task receives a new record, it accesses the state to get the current count, increments the count, updates the state, and emits the new count.
zh_cn: 当任务收到一个新的记录后，首先会访问状态获取当前统计的记录数目，然后把数目增加并更新状态，最后将更新后的数目发送出去。

source: When the temperature is over a given threshold and the smoke level is high, the application emits a fire alert.
zh_cn: 当温度超过给定阈值且烟雾指数很高时，应用就会发出火灾警报。

source: When the timer fires, a call‐ back method is called and the context of timer’s key is loaded.
zh_cn: 计时器在触发时，会调用回调方法并加载计时器键值的上下文。

source: When the timer fires, a new timer is regis‐ tered.
zh_cn: 当一个计时器触发时又会注册一个新计时器。

source: When the timer of a window fires, the JoinFunction is
zh_cn: 当窗口的计时器触发时，

source: When the train exits the tunnel, she comes back online, and pending events are sent to the application.
zh_cn: 在地铁离开隧道，爱丽丝重新上线后，之前缓存的事件才会发送给应用。

source: When the trigger condition is met, the bucket contents are sent to an evaluation func‐ tion that applies the computation logic on the bucket elements.
zh_cn: 当触发条件满足时，桶中的内容会发送给一个计算函数（evaluation function），由它来对桶内元素应用计算逻辑。

source: When the trigger condition is met, the bucket contents are sent to an evaluation function that applies the computation logic on the bucket elements.
zh_cn: 当触发条件满足时，桶内数据会发送给一个计算函数（evaluation function），由它来对桶中的元素应用计算逻辑。

source: When the watermark passes the window’s end timestamp plus the lateness interval, the window is finally deleted and all subsequent late elements are discarded.
zh_cn: 当水位线超过了窗口结束时间加延迟容忍度间隔，窗口才会被最终删除，此后所有的迟到元素都将直接丢弃。

source: When the window border is passed, all the events are sent to an evaluation func‐ tion for processing.
zh_cn: 在窗口边界通过后，所有事件会发送给计算函数进行处理。

source: When triggers are merged, all descriptors of custom states must be provided to the
zh_cn: 在合并触发器时，需要把所有自定义状态的描述符传给OnMergeContext对象的mergePartitionedState()方法。

source: When using Properties, the list of brokers has to be provided as a "bootstrap.servers" property.
zh_cn: 在使用Properties对象时，需要通过"bootstrap.servers"属性提供Broker列表。

source: When using a rich function, you can implement two additional methods to the func‐ tion’s lifecycle:
zh_cn: 在使用富函数的时候，你可以针对函数生命周期实现两个额外的方法：

source: When using event-time windows, you can specify an additional time period called allowed lateness.
zh_cn: 在使用事件时间窗口时，你可以指定一个名为延迟容忍度（allowed lateness）的额外时间段。

source: When using per-window state in a trigger, you need to ensure that this state is prop‐ erly deleted when the window is deleted.
zh_cn: 当在触发器中使用了单个窗口状态时，你需要保证它们会随着窗口删除而被正确地清理。

source: When using the Scala API or Java 8, the mapper can also be expressed as a lambda function:
zh_cn: 在使用Scala API或Java 8时，你还可以通过Lambda函数来表示映射器。

source: When writing messages to a Kafka topic, a Flink Kafka sink task can choose to which partition of the topic to write.
zh_cn: 在将消息写入Kafka某个主题时，Flink Kafka数据汇可以选择写入目标主题的哪个分区。

source: When you create the deployments for the first time, it will take a while until the Flink container image is downloaded.
zh_cn: 在首次创建Deployment的时候需要花一些时间下载Flink容器镜像。

source: When you enable checkpointing for an application, you have to specify the check‐ pointing interval—the interval in which the JobManager will initiate checkpoints at the sources of the application.
zh_cn: 当你在应用中启用检查点后，必须为其指定生成间隔，即JobManager通过应用数据源初始化检查点的频率。

source: When you enter the coffee shop, there might be other customers inside already.
zh_cn: 当你进门的时候，可能已经有别的顾客在里面了。

source: When you specify a window to collect events in one-minute buckets, which events exactly will each bucket contain?
zh_cn: 当你指定一个窗口来收集每分钟的桶内事件时，每个桶中需要包含哪些事件？

source: When you submit the application via a submission client and specify the parallelism to be 16, the source will run with a parallelism of 16, the mapper will run with 32 tasks, and the sink will run with 2 tasks.
zh_cn: 当你通过提交客户端提交应用且将并行度设置为16时，数据源会以16的并行度运行，map将运行32个任务，数据汇将运行2个任务。

source: Whenever an idempotent sink connector is not suitable, either the characteristics of the application’s output, the properties of the required sink system, or due to stricter consistency requirements, transactional sink connectors can be an alternative.
zh_cn: 无论是幂等性数据汇不适用于应用的输出特性或所需数据汇系统属性的情况，还是出于更严格的一致性要求，我们都可以选择事务性数据汇连接器作为替代方案。

source: Where to Go from Here?
zh_cn: 还有什么？

source: Where to Go from Here?.
zh_cn: 还有什么？

source: Where to go from here?.
zh_cn: 还有什么？

source: Whether a data source can reset its input stream depends on its implementation and the external system or interface from which the stream is consumed.
zh_cn: 数据源能否重置其输入流取决于它的具体实现以及所消费外部系统是否提供相关接口。

source: While Alice’s phone loses connection when inside the tunnel, Bob’s phone remains connected and delivers events to the gaming application.
zh_cn: 当爱丽丝的手机在隧道里没信号的时候，鲍勃的手机依然能联网向后端游戏应用发送事件。

source: While a sink writes to a file, the file is in the in-progress state.
zh_cn: 当数据汇写入文件时，文件会处于进行状态。

source: While a task checkpoints its state, it is blocked and its input is buffered.
zh_cn: 任务在将其状态存入检查点的过程中，会处于阻塞状态，此时的输入会进入缓冲区。

source: While adding or removing state from an application is rather easy and does not affect savepoint compatibility, modifying the state of an existing operator is more involved.
zh_cn: 虽然从应用中增删状态非常容易，也不会影响保存点兼容性，但一旦涉及修改已有算子的状态，问题就会变得十分复杂。

source: While being idle, Flink’s watermark propagation mechanism will
zh_cn: 在数据源空闲状态下，Flink的水位线传播机制会忽略掉所有空闲的数据流分区。

source: While developers have lots of flexibility to interact with state, Flink’s runtime manages tera‐ bytes of state and ensures exactly-once semantics in case of failure.
zh_cn: 在为开发人员和状态之间提供大量灵活交互的基础上，Flink的运行时可以管理起TB级别的状态且在故障时保证精确一次语义。

source: While evictors are optional components, each window operator needs a trigger to decide when to evaluate its windows.
zh_cn: 虽然移除器并非必须，但每个窗口算子都需要一个触发器来决定何时对窗口进行计算。

source: While in the logical dataflow graph the nodes represent operators, in the physical dataflow, the nodes are tasks.
zh_cn: 在逻辑Dataflow图中，顶点代表算子；而在物理Dataflow图中，顶点代表任务。

source: While it is waiting, it continues pro‐ cessing records from stream partitions that did not provide a barrier yet.
zh_cn: 在等待过程中，它会继续处理那些从还未提供分隔符的分区发来的数据。

source: While period‐ ically loading data into a data analysis system has been the state of the art for many years, it adds considerable latency to the analytics pipeline.
zh_cn: 虽然周期性地将数据导入分析系统在多年来一直是最先进的方法，但它会给分析流程带来相当大的延迟。

source: While previous stream processors only provided either high throughput or low latency, systems of the third generation are able to serve both ends of the spectrum.
zh_cn: 前几代的流处理引擎只能在高吞吐和低延迟之中取其一，而第三代的系统可以兼顾两者，

source: While previous stream processors only pro‐ vide either high throughput or low latency, systems of the third generation are able to serve both ends of the spectrum.
zh_cn: 前几代的流处理引擎只能在高吞吐和低延迟之间二选其一，而第三代的系统可以兼顾两者，

source: While processing the data, the task can read and update its state and compute its result based on its input data and state.
zh_cn: 在处理这些数据的过程中，任务对其状态进行读取或更新，并根据状态和输入数据计算结果。

source: While processing time is easy to understand because it is based on the local time of the processing machine, it produces somewhat arbitrary, incon‐ sistent, and nonreproducible results.
zh_cn: 虽然处理时间是基于处理机器的本地时间，相对容易理解，但它会产生一些较为随意、不一致且无法重现的结果。

source: While processing-time is easy to understand because it is based on the local time of the processing machine, it produces somewhat arbitrary, inconsistent, and non-reproducible results.
zh_cn: 虽然处理时间是基于处理机器的本地时间，相对容易理解，但它会产生一些较为随意、不一致且无法重现的结果。

source: While rebalance() will create communication channels between all sending tasks to all receiving tasks, rescale() will only cre‐ ate channels from each task to some of the tasks of the downstream operator.
zh_cn: rebalance()会在所有发送任务和接收任务之间建立通信通道；而rescale()中每个发送任务只会和下游算子的部分任务建立通道。

source: While scaling stateless opera‐ tors is trivial, changing the parallelism of stateful operators is much more challenging because their state needs to be repartitioned and assigned to more or fewer parallel tasks.
zh_cn: 对于无状态的算子，扩缩容很容易。但对于状态化算子，改变并行度就会复杂很多，因为我们需要把状态重新分组，分配到与之前数量不等的并行任务上。

source: While some chapters are descriptive and aim to introduce concepts and high-level design, others are more hands-on and contain many code examples.
zh_cn: 书中部分章节会侧重描述概念或高层次的设计理念，而其余章节会更加侧重实践并包含很多示例代码。

source: While some chapters are descriptive and aim to introduce high-level design concepts, others are more hands-on and contain many code examples.
zh_cn: 书中部分章节会侧重描述高层次的设计理念，而其余章节会更加注重实践并包含了很多示例代码。

source: While streaming applications are stateful and contin‐ uously running, batch applications are periodically executed.
zh_cn: 流式应用需要连续运行和维护状态，而批处理应用则会定期执行。

source: While the application is catching up, the processing latency—the time at which input is available until it is actually processed—increases.
zh_cn: 应用在追赶进度期间，其处理延迟（输入从可用到实际处理的时间间隔）会有所增加。

source: While the approach of periodically loading data into data analysis systems has been the state-of-the-art for many years, it suffers from a notable drawback.
zh_cn: 虽然周期性地将数据导入分析系统多年来一直是最先进的方法，但它有个明显的缺点，

source: While the first option gives very fast state access, it is limited by the size of the memory.
zh_cn: 前者状态访问会更快一些，但会受到内存大小的限制；

source: While the interface of the AggregateFunction is much more flexible, it is also more complex to implement compared to the interface of the ReduceFunction.
zh_cn: 虽然AggregateFunction和ReduceFunction相比接口更加灵活，但同时实现也更为复杂。

source: While this approach is easy to implement, it suffers from a major issue: each request to the external datastore adds significant
zh_cn: 虽然该方法很容易实现，但它存在一个严重问题：每次请求外部数据库都会带来很多延迟（一次请求和回复过程包含两条网络消息），

source: While this approach provides very low latencies to read or write state, it has
zh_cn: 虽然这种方法读写状态的延迟会很低，

source: While this behavior seems to be exactly the same as recovering an application from a failure using a checkpoint, failure recovery is actually just a special case.
zh_cn: 这个行为看上去和利用检查点将应用从故障中恢复完全一致，但其实故障恢复只是一种特殊情况，

source: While this book is particularly focused on stream processing, Flink is in fact a general-purpose distributed data processing framework and can be used for other types of data analysis as well.
zh_cn: 虽然本书的关注重点在于流处理，但Flink其实是一个通用的分布式数据处理框架，它同样可用于其他类型的数据分析。

source: While this kind of delay may have been acceptable in the past, applications today must be able to collect data in real-time and immediately act on it (e.g., by adjusting to changing con‐ ditions in a mobile game or by personalizing user experiences for an online retailer).
zh_cn: 虽然从过去视角来看，这种延迟可以接受，但当今的应用必须能够实时收集数据并迅速响应（例如调整手游中的某个可变条件或使用户在网购过程中获得个性化体验）。

source: While this might yield incomplete or inaccurate results, the results are produced in a timely fashion with lower latency.
zh_cn: 虽然这会导致结果不完整或不准确，但相应地可以做到以较低延迟及时生成结果。

source: While we intended for the book to be read in chapter order when we were writing it, readers familiar with a chapter’s content might want to skip it.
zh_cn: 尽管我们在写书的时候是按照预期阅读顺序进行的章节编排，但如果你已经对某些章节的内容很熟悉，仍可以选择跳过。

source: While worker failures are handled by the ResourceManager, failures of the JobManager component require the configura‐ tion of a highly available (HA) setup.
zh_cn: 虽然工作进程的故障可以由ResourceManager来解决，但JobManager组件的故障就需要额外的高可用（HA）配置。

source: While you might get annoyed by this delay, most other customers will still be happy.
zh_cn: 虽然你可能因为这次耽搁而不高兴，但这丝毫不会影响其余大多数顾客的心情。

source: While you want latency to be as low as possible, you generally want throughput to be as high as possible.
zh_cn: 通常情况下延迟是越低越好，而显然吞吐则是越高越好。

source: Window Join
zh_cn: 基于窗口的Join

source: Window Operators
zh_cn: 窗口算子

source: Window Operators | 123
zh_cn: 窗口算子 | 123

source: Window Operators | 131
zh_cn: 窗口算子 | 131

source: Window Operators | 133
zh_cn: 窗口算子 | 133

source: Window Operators | 141
zh_cn: 窗口算子 | 141

source: Window Operators | 143
zh_cn: 窗口算子| 143

source: Window assigners
zh_cn: 窗口分配器

source: Window content
zh_cn: 窗口内容

source: Window functions define the computation that is performed on the elements of a window.
zh_cn: 窗口函数定义了针对窗口内元素的计算逻辑。

source: Window lifecycle
zh_cn: 窗口的生命周期

source: Window object
zh_cn: 窗口对象

source: Window operations
zh_cn: 窗口操作

source: Window operations are closely related to two dominant concepts in stream process‐ ing: time semantics and state management.
zh_cn: 窗口操作与流处理中两个核心概念密切相关：时间语义（time semantics）和状态管理（state management）。

source: Window operations continuously create finite sets of events called buckets from an unbounded event stream and let us perform computations on these finite sets.
zh_cn: 窗口操作会持续创建一些称为桶（bucket）的有限事件集合，并允许我们基于这些有限集进行计算。

source: Window operators can be applied on a keyed or a nonkeyed stream.
zh_cn: 窗口算子可用在键值分区或非键值分区的数据流上。

source: Window operators defined using Flink’s built-in window assigners can address many common use cases.
zh_cn: 使用Flink内置窗口分配器定义的窗口算子可以应对许多常见用例。

source: Window operators provide a way to group events in buckets of finite size and apply computations on the bounded contents of these buckets.
zh_cn: 窗口算子提供了一种基于有限大小的桶对事件进行分组，并对这些桶中的有限内容进行计算的方法。

source: Window operators, time-based transformations, stateful operators, and connectors are discussed in the next chapters.
zh_cn: 有关窗口算子、基于时间的转换、状态化算子以及连接器的内容将在接下来的几章讨论。

source: Window opera‐ tors on keyed windows are evaluated in parallel, and nonkeyed windows are processed in a single thread.
zh_cn: 用于键值分区窗口的窗口算子可以并行计算，而非键值分区窗口只能单线程处理。

source: Window policies decide when new buckets are created, which events are assigned to which buckets, and when the con‐ tents of a bucket get evaluated.
zh_cn: 这些窗口策略决定了什么时间创建桶，事件如何分配到桶中以及桶中的内容什么时间参与计算。

source: Window policies decide when new buckets are created, which events are assigned to which buckets, and when the contents of a bucket get evaluated.
zh_cn: 这些窗口策略决定了什么时间创建桶，事件如何分配到桶中以及桶内数据什么时间参与计算。

source: Window transformations are described in detail in “Window Operators” on page 122.
zh_cn: 有关窗口转换的详细内容会在122页"窗口算子"一节介绍。

source: WindowFunction has been superseded by ProcessWindow Function and will not be discussed here.
zh_cn: 但该接口已经被ProcessWindowFunction取代，所以此处我们不再讨论。

source: Windows
zh_cn: 窗口

source: Windows are common operations in streaming applications.
zh_cn: 窗口是流式应用中一类十分常见的操作。

source: Windows with time-based trig‐ gers (both processing time and event time) are not affected by this because they trig‐ ger and purge their state based on time.
zh_cn: 基于时间（无论是处理时间还是事件时间）触发的窗口则不受该问题的影响，因为它们会根据不断前进的时间触发计算并清除状态。

source: With a shuffle or broadcast connection, each sending task needs a buffer for each receiving task; the number of required buffers is quadratic to the number of tasks of the involved operators.
zh_cn: 在Shuffle或广播连接的情况下，每个发送任务都需要为每个接收任务提供一个缓冲区，因此所需的缓冲区数量可达到相关算子任务数的平方级别。

source: With the default configuration, each column family requires about 200 MB to 240 MB of off- heap memory.
zh_cn: 默认配置的情况下，每个列簇需要大约200MB到240MB的堆外内存。

source: With the exception of being nonparallel and parallel, both interfaces are identical.
zh_cn: 除了并行和非并行外，两个接口没什么区别。

source: With this book, we hope to reach developers, engineers, and streaming enthusiasts around the world and grow the Flink community even larger.
zh_cn: 通过本书，我们期待能够吸引世界各地的开发者、工程师以及流处理爱好者加入，进一步扩大Flink社区。

source: With this in mind, you can use watermarks to balance result latency and result completeness.
zh_cn: 记住这些，你就可以使用水位线来平衡结果的延迟和完成整。

source: Within a slot-sharing group, the tasks are assigned to slots as described in “Task Execution” on page 40—each slot processes up to one task of each operator that is a member.
zh_cn: 同一处理槽共享组内的任务会像第40页"任务执行"一节中所介绍的那样分配到不同处理槽中——每个处理槽只能处理同一共享组内每个算子至多一个任务。

source: Within each instance, every dis‐ tinct state of the operator is stored in a separate column family (or table).
zh_cn: 每个实例都会将其独有的算子状态存入单独的列簇（或表）中。

source: Writing a DataStream into a queryable state sink
zh_cn: 将DataStream写入可查询式状态的数据汇中

source: Writing a stream into files is a common requirement, for example, to prepare data with low latency for offline ad-hoc analysis.
zh_cn: 将数据流写入文件是一种很常见的需求，例如我们可能需要为离线的即席分析准备延迟较低的数据。

source: YARN grants resources as containers3 that are distributed in the cluster and in which applications run their pro‐ cesses.
zh_cn: YARN以容器3 的形式发放资源，这些容器分布在集群之上并允许应用在其中运行自己的进程。

source: YARN is a cluster resource and container manager.
zh_cn: YARN是一个集群资源和容器的管理器。

source: YARN is the resource manager component of Apache Hadoop.
zh_cn: YARN是Apache Hadoop的资源管理器组件。

source: YARN only counts the number of restarts due to application failures—restarts due to preemption, hardware failures, or reboots are not taken into account for the number of application attempts.
zh_cn: YARN只会计算因为应用故障导致重启的次数，而由于抢占、硬件故障或重启等因素导致的重启将不会算在应用尝试次数内。

source: YARN session in detached mode using the -d flag.
zh_cn: 你还可以通过添加-d参数来启动一个分离（detached）模式的YARN会话，

source: You Should Define Unique Operator IDs
zh_cn: 最好为每个算子定义唯一ID

source: You also know a little bit about the evolution of the open source stream processing space and what a Flink streaming application looks like.
zh_cn: 还了解了开源流处理领域的发展过程以及Flink流式应用的模样。

source: You apply a function on the connected streams.
zh_cn: 在联结后的数据流上应用一个函数。

source: You are probably not surprised that stateful stream processing is the right technology to build low-latency analytics pipelines.
zh_cn: 你应该会理所当然地想到状态化流处理就是构建低延迟分析流水线的恰当技术。

source: You can access it via YARN’s Web UI, which provides a link on the Application Overview page under “Tracking URL: ApplicationMaster.”
zh_cn: 你可以通过YARN的Web UI对其进行访问，具体链接位置在"Tracking URL: ApplicationMaster"下的Application Overview页面上。

source: You can access the Web UI by opening http://localhost:8081 in your browser.
zh_cn: 你可以在浏览器中打开http://localhost:8081来访问Web UI。

source: You can access the default paral‐ lelism of the environment as shown in the following example:
zh_cn: 你可以按照下面的示例来访问环境的默认并行度：

source: You can adjust RocksDB’s configuration and tweak its performance with many parameters.
zh_cn: 和调整RocksDB配置及性能相关的参数有很多，你可以自行尝试。

source: You can also apply a CoProcessFunction to ConnectedStreams.
zh_cn: 你也可以对ConnectedStreams应用CoProcessFunction。

source: You can also build the JAR file yourself by following the steps in the repository’s README file.
zh_cn: 你也可以根据代码库中README文件的指示自行构建JAR文件。

source: You can also configure the root directories at the remote storage to which checkpoints (state.checkpoints.dir) and savepoints (state.savepoints.dir) are written.
zh_cn: 你还可以配置用于写入检查点（state.checkpoints.dir）和保存点（state.savepoints.dir）的远程存储路径。

source: You can also configure the sink to log write only failures by calling setLogFailuresOnly(true) on the sink object.
zh_cn: 还可以在数据汇对象上调用setLogFailuresOnly(true)让它仅将故障写入日志中。

source: You can also define a user scope for metrics by calling the addGroup() method of the
zh_cn: 你还可以像示例10-8那样，通过调用MetricGroup的addGroup()方法为指标定义一个用户域。

source: You can also delete them if you do not need them.
zh_cn: 如果不需要，也可以将它们删除。

source: You can also download the source code of the examples as a zip-archive from GitHub:
zh_cn: 你也可以把示例代码以Zip压缩包的形式从GitHub上下载下来：

source: You can also explicitly choose the state backend of an application:
zh_cn: 你也可以针对某个应用显式指定状态后端：

source: You can also just take a savepoint to version and archive the state of an applica‐ tion.
zh_cn: 你还可以为保存点设置不同版本并将应用状态归档。

source: You can also override the default parallelism of the environment, but you will no longer be able to control the parallelism of your application via the submission client:
zh_cn: 你也可以覆盖环境的默认并行度，然而一旦如此，将再无法通过提交客户端控制应用并行度：

source: You can also provide a custom filesystem connector.
zh_cn: 你也可以提供自定义的文件系统连接器。

source: You can also shutdown a cluster using the REST call that is shown in Table 10-6.
zh_cn: 你还可以使用表10-6中的REST调用关闭集群。
